Tekla Open API Reference for Tekla Structures 2025
AnalysisCompositeBeam Class
 The AnalysisCompositeBeam class contains information related to analysis composite beams.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisCompositeBeam
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisCompositeBeam
Public NotInheritable Class AnalysisCompositeBeam
The AnalysisCompositeBeam type exposes the following members.
Constructors
Name | Description
AnalysisCompositeBeam
Initializes a new instance of the AnalysisCompositeBeam class
Top
Properties
Name | Description
Composite
 Indicates whether the beam is composite.
ConcreteStrength
 The strength of the concrete of the analysis composite beam.
RibDirection
 The direction of the rib of the analysis composite beam (in the global coordinate system).
RibHeight
 The height of the rib of the analysis composite beam.
RibWidth
 The width of the rib of the analysis composite beam.
SlabMaterial
 The slab material of the analysis composite beam.
SlabThickness
 The thickness of the slab of the analysis composite beam.
SlabWidthLeft
 The left width of the slab of the analysis composite beam.
SlabWidthRight
 The right width of the slab of the analysis composite beam.
StudDiameter
 The diameter of the stud of the analysis composite beam.
StudLength
 The length of the stud of the analysis composite beam.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace